app/views/gps_data/_display.html.erb

      <div id="map-canvas" style="position:relative;width:640px; height:400px; border: 1px solid black;"></div>
      <%if current_user.roles.first.name == "GP" %>
---
SELECT "roles".* FROM "roles" INNER JOIN "roles_users" ON "roles"."id" = "roles_users"."role_id" WHERE "roles_users"."user_id" = 4