app/controllers/cigs_per_days_controller.rb

SELECT "cigs_per_days".* FROM "cigs_per_days"
---
  def index
    @cigs_per_days = CigsPerDay.all

SELECT "cigs_per_days".* FROM "cigs_per_days" WHERE "cigs_per_days"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @cigs_per_day = CigsPerDay.find(params[:id])

INSERT INTO "cigs_per_days" ("created_at", "no_of_cigs", "updated_at") VALUES (?, ?, ?)  [["created_at", Thu, 11 Apr 2013 13:43:07 UTC +00:00], ["no_of_cigs", 5], ["updated_at", Thu, 11 Apr 2013 13:43:07 UTC +00:00]]
---
  def create
    @cigs_per_day = CigsPerDay.new(params[:cigs_per_day])

    respond_to do |format|
      if @cigs_per_day.save