app/controllers/family_controller.rb

SELECT "sw_diaries".* FROM "sw_diaries" ORDER BY "sw_diaries"."id" DESC LIMIT 1
---
	def instructions
		@health_datum = HealthDatum.last
		@gp_diagnosis = GpDiagnosis.last
		@sw_diary = SwDiary.last

SELECT "gps_data".* FROM "gps_data"
---
	def movements
		 @g = GpsData.all