app/controllers/gps_data_controller.rb

SELECT "gps_data".* FROM "gps_data"
---
 def index
   @g = GpsData.all