app/controllers/health_data_controller.rb

  def show
    @health_datum = HealthDatum.find(params[:id])

    @cigs_per_day = CigsPerDay.last
---
SELECT "cigs_per_days".* FROM "cigs_per_days" ORDER BY "cigs_per_days"."id" DESC LIMIT 1