app/controllers/panic_alarms_controller.rb

  def index
    @panic_alarms = PanicAlarm.all
---
SELECT "panic_alarms".* FROM "panic_alarms"

  def show
    @panic_alarm = PanicAlarm.find(params[:id])
---
SELECT "panic_alarms".* FROM "panic_alarms" WHERE "panic_alarms"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @panic_alarm = PanicAlarm.new(params[:panic_alarm])

    respond_to do |format|
      if @panic_alarm.save
---
INSERT INTO "panic_alarms" ("activated", "created_at", "updated_at") VALUES (?, ?, ?)  [["activated", true], ["created_at", Wed, 10 Apr 2013 17:46:44 UTC +00:00], ["updated_at", Wed, 10 Apr 2013 17:46:44 UTC +00:00]]