app/controllers/sleep_data_controller.rb

SELECT "sleep_data".* FROM "sleep_data" WHERE (start_time >= '2013-04-04 12:54:40.866867') LIMIT 8 OFFSET 0
SELECT COUNT(*) FROM "sleep_data" WHERE (start_time >= '2013-04-04 12:54:40.866867')
---
   def index
   		@sd = SleepData.where('start_time >= ?', 1.week.ago).paginate(:page => params[:page], :per_page => 1,)