app/controllers/sleep_data_controller.rb

SELECT "sleep_data".* FROM "sleep_data"
---
   def index
   @sd = SleepData.all