app/controllers/sw_diaries_controller.rb

SELECT "sw_diaries".* FROM "sw_diaries"
---
  def index
    @sw_diaries = SwDiary.all

SELECT "sw_diaries".* FROM "sw_diaries" WHERE "sw_diaries"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @sw_diary = SwDiary.find(params[:id])

INSERT INTO "sw_diaries" ("created_at", "diary", "updated_at") VALUES (?, ?, ?)  [["created_at", Wed, 10 Apr 2013 16:51:50 UTC +00:00], ["diary", "Diary here\r\n"], ["updated_at", Wed, 10 Apr 2013 16:51:50 UTC +00:00]]
---
  def create
    @sw_diary = SwDiary.new(params[:sw_diary])

    respond_to do |format|
      if @sw_diary.save